levelset/case/system/gas/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/gas";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          Diagonal;
    }

    U
    {
        solver          Diagonal;
    }

    T
    {
        solver          Diagonal;
    }

    dp
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-07;
        relTol          0;
    }
}

// ************************************************************************* //
